pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.h
//---------------------------------------------------------------------------*
//                                                                           *
//                     File 'pic18_metrics_analysis.h'                       *
//                        Generated by version 2.4.3                         *
//                      june 17th, 2013, at 15h21'30"                        *
//                                                                           *
//---------------------------------------------------------------------------*

//--- START OF USER ZONE 1


//--- END OF USER ZONE 1

#ifndef pic18_metrics_analysis_ENTITIES_DEFINED
#define pic18_metrics_analysis_ENTITIES_DEFINED

//---------------------------------------------------------------------------*

#include "galgas2/predefined-types.h"

//---------------------------------------------------------------------------*

#include "pic18_metamodel.h"
#include "generic_metamodel.h"
#include "pic18_intermediate_next_intruction_is_reachable.h"
#include "pic18_intermediate_classes.h"
#include "pic18_mnemonics.h"
#include "intermediate_generic.h"
#include "piccoloDevice_semantics.h"
#include "pic18_optimizations.h"

//---------------------------------------------------------------------------*

class GALGAS_routineCallGraph ;
class GALGAS_symbolTableForStackLevels ;
class GALGAS_routineHasLoopMap ;
class GALGAS_routineMinMaxMap ;
class GALGAS_symbolTableForStackLevels_2E_element ;
class GALGAS_routineHasLoopMap_2E_element ;
class GALGAS_routineMinMaxMap_2E_element ;

//---------------------------------------------------------------------------*
//                                                                           *
//                          @routineCallGraph graph                          *
//                                                                           *
//---------------------------------------------------------------------------*

class GALGAS_routineCallGraph : public AC_GALGAS_graph {
//--------------------------------- Default constructor
  public : GALGAS_routineCallGraph (void) ;

//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_routineCallGraph extractObject (const GALGAS_object & inObject,
                                                         C_Compiler * inCompiler,
                                                         const GALGAS_location & inErrorLocation
                                                         COMMA_LOCATION_ARGS) ;

//--------------------------------- GALGAS constructors
  public : static GALGAS_routineCallGraph constructor_emptyGraph (LOCATION_ARGS) ;


//--------------------------------- Modifiers
  public : VIRTUAL_IN_DEBUG void modifier_addNode (GALGAS_lstring inArgument0,
                                                   GALGAS_string inArgument1,
                                                   C_Compiler * inCompiler
                                                   COMMA_LOCATION_ARGS) ;


//--------------------------------- Instance Methods
  public : VIRTUAL_IN_DEBUG void method_topologicalSort (GALGAS_stringlist & outArgument0,
                                                         GALGAS_lstringlist & outArgument1,
                                                         GALGAS_stringlist & outArgument2,
                                                         GALGAS_lstringlist & outArgument3,
                                                         C_Compiler * inCompiler
                                                         COMMA_LOCATION_ARGS) const ;

//--------------------------------- Class Methods

//--------------------------------- Readers

//--------------------------------- Introspection
  public : VIRTUAL_IN_DEBUG const C_galgas_type_descriptor * staticTypeDescriptor (void) const ;
 
} ; // End of GALGAS_routineCallGraph class


//---------------------------------------------------------------------------*

extern const C_galgas_type_descriptor kTypeDescriptor_GALGAS_routineCallGraph ;

//---------------------------------------------------------------------------*
//                                                                           *
//                      @symbolTableForStackLevels map                       *
//                                                                           *
//---------------------------------------------------------------------------*

class cMapElement_symbolTableForStackLevels ;

//---------------------------------------------------------------------------*

extern const char * kSearchErrorMessage_symbolTableForStackLevels_searchKey ;

//---------------------------------------------------------------------------*

class GALGAS_symbolTableForStackLevels : public AC_GALGAS_map {
//--------------------------------- Default constructor
  public : GALGAS_symbolTableForStackLevels (void) ;

//--------------------------------- Handle copy
  public : GALGAS_symbolTableForStackLevels (const GALGAS_symbolTableForStackLevels & inSource) ;
  public : GALGAS_symbolTableForStackLevels & operator = (const GALGAS_symbolTableForStackLevels & inSource) ;

//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_symbolTableForStackLevels extractObject (const GALGAS_object & inObject,
                                                                  C_Compiler * inCompiler,
                                                                  const GALGAS_location & inErrorLocation
                                                                  COMMA_LOCATION_ARGS) ;

//--------------------------------- GALGAS constructors
  public : static GALGAS_symbolTableForStackLevels constructor_emptyMap (LOCATION_ARGS) ;

  public : static GALGAS_symbolTableForStackLevels constructor_mapWithMapToOverride (const GALGAS_symbolTableForStackLevels & inOperand0
                                                                                     COMMA_LOCATION_ARGS) ;


//--------------------------------- Modifiers
  public : VIRTUAL_IN_DEBUG void modifier_insertKey (GALGAS_lstring constinArgument0,
                                                     GALGAS_uint constinArgument1,
                                                     C_Compiler * inCompiler
                                                     COMMA_LOCATION_ARGS) ;

  public : VIRTUAL_IN_DEBUG void modifier_setMStackLevelForKey (GALGAS_uint constinArgument0,
                                                                GALGAS_string constinArgument1,
                                                                C_Compiler * inCompiler
                                                                COMMA_LOCATION_ARGS) ;


//--------------------------------- Instance Methods
  public : VIRTUAL_IN_DEBUG void method_searchKey (GALGAS_lstring constinArgument0,
                                                   GALGAS_uint & outArgument1,
                                                   C_Compiler * inCompiler
                                                   COMMA_LOCATION_ARGS) const ;

//--------------------------------- Class Methods

//--------------------------------- Readers
  public : VIRTUAL_IN_DEBUG GALGAS_uint reader_mStackLevelForKey (const GALGAS_string & constinOperand0,
                                                                  C_Compiler * inCompiler
                                                                  COMMA_LOCATION_ARGS) const ;

