pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.h
  public : VIRTUAL_IN_DEBUG GALGAS_symbolTableForStackLevels reader_overriddenMap (LOCATION_ARGS) const ;


//--------------------------------- Introspection
  public : VIRTUAL_IN_DEBUG const C_galgas_type_descriptor * staticTypeDescriptor (void) const ;
//--------------------------------- 'with' accessors
  public : VIRTUAL_IN_DEBUG cMapElement_symbolTableForStackLevels * readWriteAccessForWithInstruction_hasKey (C_Compiler * inCompiler,
                                                                                                              const GALGAS_string & inKey
                                                                                                              COMMA_LOCATION_ARGS) ;

  public : VIRTUAL_IN_DEBUG cMapElement_symbolTableForStackLevels * readWriteAccessForWithInstruction_searchKey (C_Compiler * inCompiler,
                                                                                                                 const GALGAS_lstring & inKey
                                                                                                                 COMMA_LOCATION_ARGS) ;

//--------------------------------- Friend

  friend class cEnumerator_symbolTableForStackLevels ;
 
} ; // End of GALGAS_symbolTableForStackLevels class

//---------------------------------------------------------------------------*
//   Enumerator declaration                                                  *
//---------------------------------------------------------------------------*

class cEnumerator_symbolTableForStackLevels : public cGenericAbstractEnumerator {
  public : cEnumerator_symbolTableForStackLevels (const GALGAS_symbolTableForStackLevels & inEnumeratedObject,
                                                  const typeEnumerationOrder inOrder) ;

//--- Current element access
  public : GALGAS_lstring current_lkey (LOCATION_ARGS) const ;
  public : GALGAS_uint current_mStackLevel (LOCATION_ARGS) const ;
//--- Current element access
  public : GALGAS_symbolTableForStackLevels_2E_element current (LOCATION_ARGS) const ;
} ;

//---------------------------------------------------------------------------*

extern const C_galgas_type_descriptor kTypeDescriptor_GALGAS_symbolTableForStackLevels ;

//--------------------------------- 'with' accessors
cCollectionElement * readWriteAccessForWithInstruction_hasKey (C_Compiler * inCompiler,
                                                               GALGAS_symbolTableForStackLevels & ioMap,
                                                               GALGAS_string & inKey
                                                               COMMA_LOCATION_ARGS) ;

cCollectionElement * readWriteAccessForWithInstruction_searchKey (C_Compiler * inCompiler,
                                                                  GALGAS_symbolTableForStackLevels & ioMap,
                                                                  GALGAS_lstring & inKey
                                                                  COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//                          @routineHasLoopMap map                           *
//                                                                           *
//---------------------------------------------------------------------------*

class cMapElement_routineHasLoopMap ;

//---------------------------------------------------------------------------*

extern const char * kSearchErrorMessage_routineHasLoopMap_searchKey ;

//---------------------------------------------------------------------------*

class GALGAS_routineHasLoopMap : public AC_GALGAS_map {
//--------------------------------- Default constructor
  public : GALGAS_routineHasLoopMap (void) ;

//--------------------------------- Handle copy
  public : GALGAS_routineHasLoopMap (const GALGAS_routineHasLoopMap & inSource) ;
  public : GALGAS_routineHasLoopMap & operator = (const GALGAS_routineHasLoopMap & inSource) ;

//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_routineHasLoopMap extractObject (const GALGAS_object & inObject,
                                                          C_Compiler * inCompiler,
                                                          const GALGAS_location & inErrorLocation
                                                          COMMA_LOCATION_ARGS) ;

//--------------------------------- GALGAS constructors
  public : static GALGAS_routineHasLoopMap constructor_emptyMap (LOCATION_ARGS) ;

  public : static GALGAS_routineHasLoopMap constructor_mapWithMapToOverride (const GALGAS_routineHasLoopMap & inOperand0
                                                                             COMMA_LOCATION_ARGS) ;


//--------------------------------- Modifiers
  public : VIRTUAL_IN_DEBUG void modifier_insertKey (GALGAS_lstring constinArgument0,
                                                     GALGAS_bool constinArgument1,
                                                     C_Compiler * inCompiler
                                                     COMMA_LOCATION_ARGS) ;

  public : VIRTUAL_IN_DEBUG void modifier_setMHasLoopForKey (GALGAS_bool constinArgument0,
                                                             GALGAS_string constinArgument1,
                                                             C_Compiler * inCompiler
                                                             COMMA_LOCATION_ARGS) ;


//--------------------------------- Instance Methods
  public : VIRTUAL_IN_DEBUG void method_searchKey (GALGAS_lstring constinArgument0,
                                                   GALGAS_bool & outArgument1,
                                                   C_Compiler * inCompiler
                                                   COMMA_LOCATION_ARGS) const ;

//--------------------------------- Class Methods

//--------------------------------- Readers
  public : VIRTUAL_IN_DEBUG GALGAS_bool reader_mHasLoopForKey (const GALGAS_string & constinOperand0,
                                                               C_Compiler * inCompiler
                                                               COMMA_LOCATION_ARGS) const ;

