pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.h
  public : VIRTUAL_IN_DEBUG GALGAS_routineHasLoopMap reader_overriddenMap (LOCATION_ARGS) const ;


//--------------------------------- Introspection
  public : VIRTUAL_IN_DEBUG const C_galgas_type_descriptor * staticTypeDescriptor (void) const ;
//--------------------------------- 'with' accessors
  public : VIRTUAL_IN_DEBUG cMapElement_routineHasLoopMap * readWriteAccessForWithInstruction_hasKey (C_Compiler * inCompiler,
                                                                                                      const GALGAS_string & inKey
                                                                                                      COMMA_LOCATION_ARGS) ;

  public : VIRTUAL_IN_DEBUG cMapElement_routineHasLoopMap * readWriteAccessForWithInstruction_searchKey (C_Compiler * inCompiler,
                                                                                                         const GALGAS_lstring & inKey
                                                                                                         COMMA_LOCATION_ARGS) ;

//--------------------------------- Friend

  friend class cEnumerator_routineHasLoopMap ;
 
} ; // End of GALGAS_routineHasLoopMap class

//---------------------------------------------------------------------------*
//   Enumerator declaration                                                  *
//---------------------------------------------------------------------------*

class cEnumerator_routineHasLoopMap : public cGenericAbstractEnumerator {
  public : cEnumerator_routineHasLoopMap (const GALGAS_routineHasLoopMap & inEnumeratedObject,
                                          const typeEnumerationOrder inOrder) ;

//--- Current element access
  public : GALGAS_lstring current_lkey (LOCATION_ARGS) const ;
  public : GALGAS_bool current_mHasLoop (LOCATION_ARGS) const ;
//--- Current element access
  public : GALGAS_routineHasLoopMap_2E_element current (LOCATION_ARGS) const ;
} ;

//---------------------------------------------------------------------------*

extern const C_galgas_type_descriptor kTypeDescriptor_GALGAS_routineHasLoopMap ;

//--------------------------------- 'with' accessors
cCollectionElement * readWriteAccessForWithInstruction_hasKey (C_Compiler * inCompiler,
                                                               GALGAS_routineHasLoopMap & ioMap,
                                                               GALGAS_string & inKey
                                                               COMMA_LOCATION_ARGS) ;

cCollectionElement * readWriteAccessForWithInstruction_searchKey (C_Compiler * inCompiler,
                                                                  GALGAS_routineHasLoopMap & ioMap,
                                                                  GALGAS_lstring & inKey
                                                                  COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//                           @routineMinMaxMap map                           *
//                                                                           *
//---------------------------------------------------------------------------*

class cMapElement_routineMinMaxMap ;

//---------------------------------------------------------------------------*

extern const char * kSearchErrorMessage_routineMinMaxMap_searchKey ;

//---------------------------------------------------------------------------*

class GALGAS_routineMinMaxMap : public AC_GALGAS_map {
//--------------------------------- Default constructor
  public : GALGAS_routineMinMaxMap (void) ;

//--------------------------------- Handle copy
  public : GALGAS_routineMinMaxMap (const GALGAS_routineMinMaxMap & inSource) ;
  public : GALGAS_routineMinMaxMap & operator = (const GALGAS_routineMinMaxMap & inSource) ;

//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_routineMinMaxMap extractObject (const GALGAS_object & inObject,
                                                         C_Compiler * inCompiler,
                                                         const GALGAS_location & inErrorLocation
                                                         COMMA_LOCATION_ARGS) ;

//--------------------------------- GALGAS constructors
  public : static GALGAS_routineMinMaxMap constructor_emptyMap (LOCATION_ARGS) ;

  public : static GALGAS_routineMinMaxMap constructor_mapWithMapToOverride (const GALGAS_routineMinMaxMap & inOperand0
                                                                            COMMA_LOCATION_ARGS) ;


//--------------------------------- Modifiers
  public : VIRTUAL_IN_DEBUG void modifier_insertKey (GALGAS_lstring constinArgument0,
                                                     GALGAS_uint constinArgument1,
                                                     GALGAS_uint constinArgument2,
                                                     C_Compiler * inCompiler
                                                     COMMA_LOCATION_ARGS) ;

  public : VIRTUAL_IN_DEBUG void modifier_setMMaxForKey (GALGAS_uint constinArgument0,
                                                         GALGAS_string constinArgument1,
                                                         C_Compiler * inCompiler
                                                         COMMA_LOCATION_ARGS) ;

  public : VIRTUAL_IN_DEBUG void modifier_setMMinForKey (GALGAS_uint constinArgument0,
                                                         GALGAS_string constinArgument1,
                                                         C_Compiler * inCompiler
                                                         COMMA_LOCATION_ARGS) ;


//--------------------------------- Instance Methods
  public : VIRTUAL_IN_DEBUG void method_searchKey (GALGAS_lstring constinArgument0,
                                                   GALGAS_uint & outArgument1,
                                                   GALGAS_uint & outArgument2,
                                                   C_Compiler * inCompiler
                                                   COMMA_LOCATION_ARGS) const ;

//--------------------------------- Class Methods

//--------------------------------- Readers
  public : VIRTUAL_IN_DEBUG GALGAS_uint reader_mMaxForKey (const GALGAS_string & constinOperand0,
                                                           C_Compiler * inCompiler
                                                           COMMA_LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG GALGAS_uint reader_mMinForKey (const GALGAS_string & constinOperand0,
                                                           C_Compiler * inCompiler
                                                           COMMA_LOCATION_ARGS) const ;

