pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.h
  public : VIRTUAL_IN_DEBUG GALGAS_routineMinMaxMap reader_overriddenMap (LOCATION_ARGS) const ;


//--------------------------------- Introspection
  public : VIRTUAL_IN_DEBUG const C_galgas_type_descriptor * staticTypeDescriptor (void) const ;
//--------------------------------- 'with' accessors
  public : VIRTUAL_IN_DEBUG cMapElement_routineMinMaxMap * readWriteAccessForWithInstruction_hasKey (C_Compiler * inCompiler,
                                                                                                     const GALGAS_string & inKey
                                                                                                     COMMA_LOCATION_ARGS) ;

  public : VIRTUAL_IN_DEBUG cMapElement_routineMinMaxMap * readWriteAccessForWithInstruction_searchKey (C_Compiler * inCompiler,
                                                                                                        const GALGAS_lstring & inKey
                                                                                                        COMMA_LOCATION_ARGS) ;

//--------------------------------- Friend

  friend class cEnumerator_routineMinMaxMap ;
 
} ; // End of GALGAS_routineMinMaxMap class

//---------------------------------------------------------------------------*
//   Enumerator declaration                                                  *
//---------------------------------------------------------------------------*

class cEnumerator_routineMinMaxMap : public cGenericAbstractEnumerator {
  public : cEnumerator_routineMinMaxMap (const GALGAS_routineMinMaxMap & inEnumeratedObject,
                                         const typeEnumerationOrder inOrder) ;

//--- Current element access
  public : GALGAS_lstring current_lkey (LOCATION_ARGS) const ;
  public : GALGAS_uint current_mMin (LOCATION_ARGS) const ;
  public : GALGAS_uint current_mMax (LOCATION_ARGS) const ;
//--- Current element access
  public : GALGAS_routineMinMaxMap_2E_element current (LOCATION_ARGS) const ;
} ;

//---------------------------------------------------------------------------*

extern const C_galgas_type_descriptor kTypeDescriptor_GALGAS_routineMinMaxMap ;

//--------------------------------- 'with' accessors
cCollectionElement * readWriteAccessForWithInstruction_hasKey (C_Compiler * inCompiler,
                                                               GALGAS_routineMinMaxMap & ioMap,
                                                               GALGAS_string & inKey
                                                               COMMA_LOCATION_ARGS) ;

cCollectionElement * readWriteAccessForWithInstruction_searchKey (C_Compiler * inCompiler,
                                                                  GALGAS_routineMinMaxMap & ioMap,
                                                                  GALGAS_lstring & inKey
                                                                  COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//                      Routine 'pic18_compute_metrics'                      *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_pic_31__38__5F_compute_5F_metrics (const GALGAS_piccoloModel constinArgument0,
                                                const GALGAS_routineDeclarationList constinArgument1,
                                                const GALGAS_routineDeclarationList constinArgument2,
                                                const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument3,
                                                GALGAS_string & ioArgument4,
                                                const GALGAS_string constinArgument5,
                                                C_Compiler * inCompiler
                                                COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//          Category method '@piccolo_instruction enterCallInGraph'          *
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_piccolo_5F_instruction_enterCallInGraph) (const cPtr_piccolo_5F_instruction * inObject,
                                                                                 GALGAS_lstring inArgument0,
                                                                                 GALGAS_routineCallGraph & ioArgument1,
                                                                                 C_Compiler * inCompiler
                                                                                 COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_enterCallInGraph (const PMSInt32 inClassIndex,
                                           categoryMethodSignature_piccolo_5F_instruction_enterCallInGraph inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_enterCallInGraph (const cPtr_piccolo_5F_instruction * inObject,
                                          GALGAS_lstring in_inRoutineName,
                                          GALGAS_routineCallGraph & io_ioRoutineCallGraph,
                                          C_Compiler * inCompiler
                                          COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//    Category method '@pic18_intermediate_instruction exploreStackNeeds'    *
//                                                                           *
//---------------------------------------------------------------------------*

