pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.h
typedef void (*categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_exploreStackNeeds) (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                      const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument0,
                                                                                                      const GALGAS_symbolTableForOptimizations constinArgument1,
                                                                                                      const GALGAS_symbolTableForStackLevels constinArgument2,
                                                                                                      const GALGAS_uint constinArgument3,
                                                                                                      GALGAS_uint & ioArgument4,
                                                                                                      GALGAS_stringset & ioArgument5,
                                                                                                      C_Compiler * inCompiler
                                                                                                      COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_exploreStackNeeds (const PMSInt32 inClassIndex,
                                            categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_exploreStackNeeds inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_exploreStackNeeds (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                           const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constin_inGeneratedInstructionList,
                                           const GALGAS_symbolTableForOptimizations constin_inSymbolTable,
                                           const GALGAS_symbolTableForStackLevels constin_inSymbolTableForStackLevels,
                                           const GALGAS_uint constin_inCurrentLine,
                                           GALGAS_uint & io_ioStackNeeds,
                                           GALGAS_stringset & io_ioExploredLineSet,
                                           C_Compiler * inCompiler
                                           COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//      Category method '@piccolo_instruction searchForLoopInstruction'      *
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_piccolo_5F_instruction_searchForLoopInstruction) (const cPtr_piccolo_5F_instruction * inObject,
                                                                                         const GALGAS_routineHasLoopMap constinArgument0,
                                                                                         GALGAS_bool & ioArgument1,
                                                                                         C_Compiler * inCompiler
                                                                                         COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_searchForLoopInstruction (const PMSInt32 inClassIndex,
                                                   categoryMethodSignature_piccolo_5F_instruction_searchForLoopInstruction inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_searchForLoopInstruction (const cPtr_piccolo_5F_instruction * inObject,
                                                  const GALGAS_routineHasLoopMap constin_inRoutineHasLoopMap,
                                                  GALGAS_bool & io_ioHasLoopInstruction,
                                                  C_Compiler * inCompiler
                                                  COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//        Category method '@pic18_intermediate_instruction duration'         *
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_duration) (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                             const GALGAS_uint constinArgument0,
                                                                                             const GALGAS_symbolTableForOptimizations constinArgument1,
                                                                                             const GALGAS_routineMinMaxMap constinArgument2,
                                                                                             const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument3,
                                                                                             GALGAS_uintlist & ioArgument4,
                                                                                             GALGAS_uintlist & ioArgument5,
                                                                                             GALGAS_uint & ioArgument6,
                                                                                             GALGAS_uint & ioArgument7,
                                                                                             GALGAS_uint & ioArgument8,
                                                                                             GALGAS_uint & ioArgument9,
                                                                                             C_Compiler * inCompiler
                                                                                             COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_duration (const PMSInt32 inClassIndex,
                                   categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_duration inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_duration (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                  const GALGAS_uint constin_inCurrentLine,
                                  const GALGAS_symbolTableForOptimizations constin_inSymbolTable,
                                  const GALGAS_routineMinMaxMap constin_inRoutineMinMaxMap,
                                  const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constin_inGeneratedInstructionList,
                                  GALGAS_uintlist & io_ioMinArray,
                                  GALGAS_uintlist & io_ioMaxArray,
                                  GALGAS_uint & io_ioCurrentMin,
                                  GALGAS_uint & io_ioCurrentMax,
                                  GALGAS_uint & io_ioExecutionMin,
                                  GALGAS_uint & io_ioExecutionMax,
                                  C_Compiler * inCompiler
                                  COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//               @symbolTableForStackLevels_2E_element struct                *
//                                                                           *
//---------------------------------------------------------------------------*

class GALGAS_symbolTableForStackLevels_2E_element : public AC_GALGAS_root {
//--------------------------------- Public data members
  public : GALGAS_lstring mAttribute_lkey ;
  public : GALGAS_uint mAttribute_mStackLevel ;


//--------------------------------- Accessors
  public : VIRTUAL_IN_DEBUG bool isValid (void) const ;
  public : VIRTUAL_IN_DEBUG void drop (void) ;

//--------------------------------- Default constructor
  public : GALGAS_symbolTableForStackLevels_2E_element (void) ;

