pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.h
//--------------------------------- Virtual destructor (in debug mode)
  public : VIRTUAL_IN_DEBUG ~ GALGAS_symbolTableForStackLevels_2E_element (void) ;

//--------------------------------- Native constructor
  public : GALGAS_symbolTableForStackLevels_2E_element (const GALGAS_lstring & in_lkey,
                                                        const GALGAS_uint & in_mStackLevel) ;

//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_symbolTableForStackLevels_2E_element extractObject (const GALGAS_object & inObject,
                                                                             C_Compiler * inCompiler,
                                                                             const GALGAS_location & inErrorLocation
                                                                             COMMA_LOCATION_ARGS) ;

//--------------------------------- GALGAS constructors
  public : static GALGAS_symbolTableForStackLevels_2E_element constructor_new (const GALGAS_lstring & inOperand0,
                                                                               const GALGAS_uint & inOperand1
                                                                               COMMA_LOCATION_ARGS) ;

//--------------------------------- Implementation of reader 'description'
  public : VIRTUAL_IN_DEBUG void description (C_String & ioString,
                                              const PMSInt32 inIndentation) const ;
//--------------------------------- Comparison
  public : typeComparisonResult objectCompare (const GALGAS_symbolTableForStackLevels_2E_element & inOperand) const ;

//--------------------------------- Modifiers

//--------------------------------- Instance Methods
//--------------------------------- Class Methods

//--------------------------------- Readers
  public : VIRTUAL_IN_DEBUG GALGAS_lstring reader_lkey (LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG GALGAS_uint reader_mStackLevel (LOCATION_ARGS) const ;


//--------------------------------- Introspection
  public : VIRTUAL_IN_DEBUG const C_galgas_type_descriptor * staticTypeDescriptor (void) const ;
 
} ; // End of GALGAS_symbolTableForStackLevels_2E_element class


//---------------------------------------------------------------------------*

extern const C_galgas_type_descriptor kTypeDescriptor_GALGAS_symbolTableForStackLevels_2E_element ;

//---------------------------------------------------------------------------*
//                                                                           *
//                   @routineHasLoopMap_2E_element struct                    *
//                                                                           *
//---------------------------------------------------------------------------*

class GALGAS_routineHasLoopMap_2E_element : public AC_GALGAS_root {
//--------------------------------- Public data members
  public : GALGAS_lstring mAttribute_lkey ;
  public : GALGAS_bool mAttribute_mHasLoop ;


//--------------------------------- Accessors
  public : VIRTUAL_IN_DEBUG bool isValid (void) const ;
  public : VIRTUAL_IN_DEBUG void drop (void) ;

//--------------------------------- Default constructor
  public : GALGAS_routineHasLoopMap_2E_element (void) ;

//--------------------------------- Virtual destructor (in debug mode)
  public : VIRTUAL_IN_DEBUG ~ GALGAS_routineHasLoopMap_2E_element (void) ;

//--------------------------------- Native constructor
  public : GALGAS_routineHasLoopMap_2E_element (const GALGAS_lstring & in_lkey,
                                                const GALGAS_bool & in_mHasLoop) ;

//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_routineHasLoopMap_2E_element extractObject (const GALGAS_object & inObject,
                                                                     C_Compiler * inCompiler,
                                                                     const GALGAS_location & inErrorLocation
                                                                     COMMA_LOCATION_ARGS) ;

//--------------------------------- GALGAS constructors
  public : static GALGAS_routineHasLoopMap_2E_element constructor_new (const GALGAS_lstring & inOperand0,
                                                                       const GALGAS_bool & inOperand1
                                                                       COMMA_LOCATION_ARGS) ;

//--------------------------------- Implementation of reader 'description'
  public : VIRTUAL_IN_DEBUG void description (C_String & ioString,
                                              const PMSInt32 inIndentation) const ;
//--------------------------------- Comparison
  public : typeComparisonResult objectCompare (const GALGAS_routineHasLoopMap_2E_element & inOperand) const ;

//--------------------------------- Modifiers

//--------------------------------- Instance Methods
//--------------------------------- Class Methods

//--------------------------------- Readers
  public : VIRTUAL_IN_DEBUG GALGAS_lstring reader_lkey (LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG GALGAS_bool reader_mHasLoop (LOCATION_ARGS) const ;


//--------------------------------- Introspection
  public : VIRTUAL_IN_DEBUG const C_galgas_type_descriptor * staticTypeDescriptor (void) const ;
 
} ; // End of GALGAS_routineHasLoopMap_2E_element class


//---------------------------------------------------------------------------*

extern const C_galgas_type_descriptor kTypeDescriptor_GALGAS_routineHasLoopMap_2E_element ;

//---------------------------------------------------------------------------*
//                                                                           *
//                    @routineMinMaxMap_2E_element struct                    *
//                                                                           *
//---------------------------------------------------------------------------*

class GALGAS_routineMinMaxMap_2E_element : public AC_GALGAS_root {
//--------------------------------- Public data members
  public : GALGAS_lstring mAttribute_lkey ;
  public : GALGAS_uint mAttribute_mMin ;
  public : GALGAS_uint mAttribute_mMax ;


//--------------------------------- Accessors
  public : VIRTUAL_IN_DEBUG bool isValid (void) const ;
  public : VIRTUAL_IN_DEBUG void drop (void) ;

//--------------------------------- Default constructor
  public : GALGAS_routineMinMaxMap_2E_element (void) ;

