pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metrics_analysis.h
//--------------------------------- Virtual destructor (in debug mode)
  public : VIRTUAL_IN_DEBUG ~ GALGAS_routineMinMaxMap_2E_element (void) ;

//--------------------------------- Native constructor
  public : GALGAS_routineMinMaxMap_2E_element (const GALGAS_lstring & in_lkey,
                                               const GALGAS_uint & in_mMin,
                                               const GALGAS_uint & in_mMax) ;

//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_routineMinMaxMap_2E_element extractObject (const GALGAS_object & inObject,
                                                                    C_Compiler * inCompiler,
                                                                    const GALGAS_location & inErrorLocation
                                                                    COMMA_LOCATION_ARGS) ;

//--------------------------------- GALGAS constructors
  public : static GALGAS_routineMinMaxMap_2E_element constructor_new (const GALGAS_lstring & inOperand0,
                                                                      const GALGAS_uint & inOperand1,
                                                                      const GALGAS_uint & inOperand2
                                                                      COMMA_LOCATION_ARGS) ;

//--------------------------------- Implementation of reader 'description'
  public : VIRTUAL_IN_DEBUG void description (C_String & ioString,
                                              const PMSInt32 inIndentation) const ;
//--------------------------------- Comparison
  public : typeComparisonResult objectCompare (const GALGAS_routineMinMaxMap_2E_element & inOperand) const ;

//--------------------------------- Modifiers

//--------------------------------- Instance Methods
//--------------------------------- Class Methods

//--------------------------------- Readers
  public : VIRTUAL_IN_DEBUG GALGAS_lstring reader_lkey (LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG GALGAS_uint reader_mMax (LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG GALGAS_uint reader_mMin (LOCATION_ARGS) const ;


//--------------------------------- Introspection
  public : VIRTUAL_IN_DEBUG const C_galgas_type_descriptor * staticTypeDescriptor (void) const ;
 
} ; // End of GALGAS_routineMinMaxMap_2E_element class


//---------------------------------------------------------------------------*

extern const C_galgas_type_descriptor kTypeDescriptor_GALGAS_routineMinMaxMap_2E_element ;

//---------------------------------------------------------------------------*
//                                                                           *
//           Class for element of '@symbolTableForStackLevels' map           *
//                                                                           *
//---------------------------------------------------------------------------*

class cMapElement_symbolTableForStackLevels : public cMapElement {
//--- Map attributes
  public : GALGAS_uint mAttribute_mStackLevel ;

//--- Constructor
  public : cMapElement_symbolTableForStackLevels (const GALGAS_lstring & inKey,
                                                  const GALGAS_uint & in_mStackLevel
                                                  COMMA_LOCATION_ARGS) ;

//--- Virtual method for comparing elements
  public : virtual typeComparisonResult compare (const cCollectionElement * inOperand) const ;

//--- Virtual method that checks that all attributes are valid
  public : virtual bool isValid (void) const ;

//--- Virtual method that returns a copy of current object
  public : virtual cMapElement * copy (void) ;

//--- Description
 public : virtual void description (C_String & ioString, const PMSInt32 inIndentation) const ;
} ;

//---------------------------------------------------------------------------*
//                                                                           *
//               Class for element of '@routineHasLoopMap' map               *
//                                                                           *
//---------------------------------------------------------------------------*

class cMapElement_routineHasLoopMap : public cMapElement {
//--- Map attributes
  public : GALGAS_bool mAttribute_mHasLoop ;

//--- Constructor
  public : cMapElement_routineHasLoopMap (const GALGAS_lstring & inKey,
                                          const GALGAS_bool & in_mHasLoop
                                          COMMA_LOCATION_ARGS) ;

//--- Virtual method for comparing elements
  public : virtual typeComparisonResult compare (const cCollectionElement * inOperand) const ;

//--- Virtual method that checks that all attributes are valid
  public : virtual bool isValid (void) const ;

//--- Virtual method that returns a copy of current object
  public : virtual cMapElement * copy (void) ;

//--- Description
 public : virtual void description (C_String & ioString, const PMSInt32 inIndentation) const ;
} ;

//---------------------------------------------------------------------------*
//                                                                           *
//               Class for element of '@routineMinMaxMap' map                *
//                                                                           *
//---------------------------------------------------------------------------*

class cMapElement_routineMinMaxMap : public cMapElement {
//--- Map attributes
  public : GALGAS_uint mAttribute_mMin ;
  public : GALGAS_uint mAttribute_mMax ;

//--- Constructor
  public : cMapElement_routineMinMaxMap (const GALGAS_lstring & inKey,
                                         const GALGAS_uint & in_mMin,
                                         const GALGAS_uint & in_mMax
                                         COMMA_LOCATION_ARGS) ;

//--- Virtual method for comparing elements
  public : virtual typeComparisonResult compare (const cCollectionElement * inOperand) const ;

//--- Virtual method that checks that all attributes are valid
  public : virtual bool isValid (void) const ;

//--- Virtual method that returns a copy of current object
  public : virtual cMapElement * copy (void) ;

//--- Description
 public : virtual void description (C_String & ioString, const PMSInt32 inIndentation) const ;
} ;

//--- START OF USER ZONE 2


//--- END OF USER ZONE 2

#endif
